import libraries(I provide all libs that I need when make this tasks, if you need some external import them here)

In [16]:
import pyspark
from pyspark.sql import SparkSession
from pyspark.sql.types import StructType, StructField, IntegerType, StringType
from pyspark.sql.functions import col
from pyspark.sql.functions import max, avg, min, first
from pyspark.sql.window import Window
from pyspark.sql.functions import row_number
from pyspark.sql.functions import when
from pyspark.sql.functions import monotonically_increasing_id

create local SparkSession

In [2]:
spark = SparkSession.builder \
                    .master('local[*]') \
                    .appName('Trainee') \
                    .getOrCreate()

read csv with inferschema

In [9]:
df = spark.read \
          .option('header', True) \
          .csv('./ds_salaries.csv')

read csv one more time with the same code and you will see that it almostly don't take time, because info already in SparkSession and it will not read nothing
from this file

In [22]:
df = spark.read \
            .option('inferschema',True) \
            .csv('./ds_salaries.csv')

write schema of scv on screen

In [10]:
df.printSchema()

root
 |-- _c0: string (nullable = true)
 |-- work_year: string (nullable = true)
 |-- experience_level: string (nullable = true)
 |-- employment_type: string (nullable = true)
 |-- job_title: string (nullable = true)
 |-- salary: string (nullable = true)
 |-- salary_currency: string (nullable = true)
 |-- salary_in_usd: string (nullable = true)
 |-- employee_residence: string (nullable = true)
 |-- remote_ratio: string (nullable = true)
 |-- company_location: string (nullable = true)
 |-- company_size: string (nullable = true)

create schema of this scv

In [2]:
schema = StructType([
    StructField('id', IntegerType(), True),
    StructField('work_year', StringType(), True),
    StructField('experiecne_level', StringType(), True),
    StructField('employment_type', StringType(), True),
    StructField('job_title', StringType(), True),
    StructField('salary', IntegerType(), True),
    StructField('salary_currency', StringType(), True),
    StructField('salary_in_usd', IntegerType(), True),
    StructField('employee_residence', StringType(), True),
    StructField('remote_ratio', IntegerType(), True),
    StructField('company_location', StringType(), True),
    StructField('company_size', StringType(), True),
])

restart kernel without cleaning output and after restarting you need to initialize SparkSession, after initialize start execute only cells from cell with schema=
=StructType.... 
To restart kernel click Kernel, Restart.

read ds_salaries with predefined schema and compare results from this cell and cell with inferSchema

In [3]:
spark = SparkSession.builder.master('local[*]').appName('Trainee').getOrCreate()
df = spark.read \
          .option('header', True) \
          .format('csv') \
          .schema(schema) \
          .load('./ds_salaries.csv')

this happens because read operation is lazy(transformation), but if you use inferschema it start to be action that will create Spark Job, because Spark need to loop throw all file to check datatypes for all columns and this can harm to your code(if we compare to parquet, it will also go to check data types, but parquet provide meta information, so Spark will not go throw all file, he will just read meta information, but csv don't provide such meta information). Also header make Spark to create one more Spark Job to check first line
to define name of columns and remember to skeep it when reading. Actual reading start when you will use first action. More about Spark Jobs you will see in next topic

write schema of scv on screen one more time and compare with previous

In [4]:
df.printSchema()

root
 |-- id: integer (nullable = true)
 |-- work_year: string (nullable = true)
 |-- experiecne_level: string (nullable = true)
 |-- employment_type: string (nullable = true)
 |-- job_title: string (nullable = true)
 |-- salary: integer (nullable = true)
 |-- salary_currency: string (nullable = true)
 |-- salary_in_usd: integer (nullable = true)
 |-- employee_residence: string (nullable = true)
 |-- remote_ratio: integer (nullable = true)
 |-- company_location: string (nullable = true)
 |-- company_size: string (nullable = true)

now continue to work with one of the dataframes that you create

print data in dataframe using df.show

In [10]:
df.show()

+---+---------+----------------+---------------+--------------------+--------+---------------+-------------+------------------+------------+----------------+------------+
| id|work_year|experiecne_level|employment_type|           job_title|  salary|salary_currency|salary_in_usd|employee_residence|remote_ratio|company_location|company_size|
+---+---------+----------------+---------------+--------------------+--------+---------------+-------------+------------------+------------+----------------+------------+
|  0|     2020|              MI|             FT|      Data Scientist|   70000|            EUR|        79833|                DE|           0|              DE|           L|
|  1|     2020|              SE|             FT|Machine Learning ...|  260000|            USD|       260000|                JP|           0|              JP|           S|
|  2|     2020|              SE|             FT|   Big Data Engineer|   85000|            GBP|       109024|                GB|          50|              GB|           M|
|  3|     2020|              MI|             FT|Product Data Analyst|   20000|            USD|        20000|                HN|           0|              HN|           S|
|  4|     2020|              SE|             FT|Machine Learning ...|  150000|            USD|       150000|                US|          50|              US|           L|
|  5|     2020|              EN|             FT|        Data Analyst|   72000|            USD|        72000|                US|         100|              US|           L|
|  6|     2020|              SE|             FT| Lead Data Scientist|  190000|            USD|       190000|                US|         100|              US|           S|
|  7|     2020|              MI|             FT|      Data Scientist|11000000|            HUF|        35735|                HU|          50|              HU|           L|
|  8|     2020|              MI|             FT|Business Data Ana...|  135000|            USD|       135000|                US|         100|              US|           L|
|  9|     2020|              SE|             FT|  Lead Data Engineer|  125000|            USD|       125000|                NZ|          50|              NZ|           S|
| 10|     2020|              EN|             FT|      Data Scientist|   45000|            EUR|        51321|                FR|           0|              FR|           S|
| 11|     2020|              MI|             FT|      Data Scientist| 3000000|            INR|        40481|                IN|           0|              IN|           L|
| 12|     2020|              EN|             FT|      Data Scientist|   35000|            EUR|        39916|                FR|           0|              FR|           M|
| 13|     2020|              MI|             FT|   Lead Data Analyst|   87000|            USD|        87000|                US|         100|              US|           L|
| 14|     2020|              MI|             FT|        Data Analyst|   85000|            USD|        85000|                US|         100|              US|           L|
| 15|     2020|              MI|             FT|        Data Analyst|    8000|            USD|         8000|                PK|          50|              PK|           L|
| 16|     2020|              EN|             FT|       Data Engineer| 4450000|            JPY|        41689|                JP|         100|              JP|           S|
| 17|     2020|              SE|             FT|   Big Data Engineer|  100000|            EUR|       114047|                PL|         100|              GB|           S|
| 18|     2020|              EN|             FT|Data Science Cons...|  423000|            INR|         5707|                IN|          50|              IN|           M|
| 19|     2020|              MI|             FT|  Lead Data Engineer|   56000|            USD|        56000|                PT|         100|              US|           M|
+---+---------+----------------+---------------+--------------------+--------+---------------+-------------+------------------+------------+----------------+------------+
only showing top 20 rows

print data in dataframe using display(df.toPandas())

In [11]:
df.toPandas()

,id,work_year,experiecne_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,0,2020,MI,FT,Data Scientist,70000,EUR,79833,DE,0,DE,L
1,1,2020,SE,FT,Machine Learning Scientist,260000,USD,260000,JP,0,JP,S
2,2,2020,SE,FT,Big Data Engineer,85000,GBP,109024,GB,50,GB,M
3,3,2020,MI,FT,Product Data Analyst,20000,USD,20000,HN,0,HN,S
4,4,2020,SE,FT,Machine Learning Engineer,150000,USD,150000,US,50,US,L
...,...,...,...,...,...,...,...,...,...,...,...,...
602,602,2022,SE,FT,Data Engineer,154000,USD,154000,US,100,US,M
603,603,2022,SE,FT,Data Engineer,126000,USD,126000,US,100,US,M
604,604,2022,SE,FT,Data Analyst,129000,USD,129000,US,0,US,M
605,605,2022,SE,FT,Data Analyst,150000,USD,150000,US,100,US,M
606,606,2022,MI,FT,AI Scientist,200000,USD,200000,IN,100,US,L

create df_job_title that consists from all job_titles without duplicates

In [5]:
df_job_title = df.dropDuplicates(['job_title'])

print all rows from df_job_titles without truncating jobs

In [6]:
df_job_title.show(truncate=False)

+---+---------+----------------+---------------+----------------------------------+-------+---------------+-------------+------------------+------------+----------------+------------+
|id |work_year|experiecne_level|employment_type|job_title                         |salary |salary_currency|salary_in_usd|employee_residence|remote_ratio|company_location|company_size|
+---+---------+----------------+---------------+----------------------------------+-------+---------------+-------------+------------------+------------+----------------+------------+
|77 |2021     |MI              |PT             |3D Computer Vision Researcher     |400000 |INR            |5409         |IN                |50          |IN              |M           |
|52 |2020     |EN              |FT             |AI Scientist                      |300000 |DKK            |45896        |DK                |50          |DK              |S           |
|344|2022     |EX              |FT             |Analytics Engineer                |175000 |USD            |175000       |US                |100         |US              |M           |
|82 |2021     |MI              |FT             |Applied Data Scientist            |68000  |CAD            |54238        |GB                |50          |CA              |L           |
|132|2021     |MI              |FT             |Applied Machine Learning Scientist|38400  |USD            |38400        |VN                |100         |US              |M           |
|23 |2020     |MI              |FT             |BI Data Analyst                   |98000  |USD            |98000        |US                |0           |US              |M           |
|255|2021     |SE              |FT             |Big Data Architect                |125000 |CAD            |99703        |CA                |50          |CA              |M           |
|2  |2020     |SE              |FT             |Big Data Engineer                 |85000  |GBP            |109024       |GB                |50          |GB              |M           |
|8  |2020     |MI              |FT             |Business Data Analyst             |135000 |USD            |135000       |US                |100         |US              |L           |
|95 |2021     |MI              |FT             |Cloud Data Engineer               |120000 |SGD            |89294        |SG                |50          |SG              |L           |
|54 |2020     |SE              |FL             |Computer Vision Engineer          |60000  |USD            |60000        |RU                |100         |US              |S           |
|98 |2021     |EN              |FT             |Computer Vision Software Engineer |70000  |USD            |70000        |US                |100         |US              |M           |
|5  |2020     |EN              |FT             |Data Analyst                      |72000  |USD            |72000        |US                |100         |US              |L           |
|80 |2021     |SE              |FT             |Data Analytics Engineer           |67000  |EUR            |79197        |DE                |100         |DE              |L           |
|523|2022     |SE              |FT             |Data Analytics Lead               |405000 |USD            |405000       |US                |100         |US              |L           |
|158|2021     |SE              |FT             |Data Analytics Manager            |120000 |USD            |120000       |US                |100         |US              |M           |
|169|2021     |MI              |FT             |Data Architect                    |150000 |USD            |150000       |US                |100         |US              |L           |
|16 |2020     |EN              |FT             |Data Engineer                     |4450000|JPY            |41689        |JP                |100         |JP              |S           |
|30 |2020     |MI              |FT             |Data Engineering Manager          |51999  |EUR            |59303        |DE                |100         |DE              |S           |
|18 |2020     |EN              |FT             |Data Science Consultant           |423000 |INR            |5707         |IN                |50          |IN              |M           |
+---+---------+----------------+---------------+----------------------------------+-------+---------------+-------------+------------------+------------+----------------+------------+
only showing top 20 rows

create  df_analytic that will consists from max, avg, min USD salaries for all job_titles using groupBy. name of fields is avg_salary, min_salary, max_salary

In [7]:
df_analytic = df_job_title.groupBy('job_title') \
                          .agg(max('salary_in_usd').alias('max_salary'),
                               min('salary_in_usd').alias('min_salary'),
                               avg('salary_in_usd').alias('avg_salary'))

print all rows from df_analytic without trancating jobs

In [8]:
df_analytic.show(truncate=False)

+----------------------------------------+----------+----------+----------+
|job_title                               |max_salary|min_salary|avg_salary|
+----------------------------------------+----------+----------+----------+
|3D Computer Vision Researcher           |5409      |5409      |5409.0    |
|Lead Data Engineer                      |125000    |125000    |125000.0  |
|Head of Machine Learning                |79039     |79039     |79039.0   |
|Data Specialist                         |165000    |165000    |165000.0  |
|Data Analytics Lead                     |405000    |405000    |405000.0  |
|Machine Learning Scientist              |260000    |260000    |260000.0  |
|Lead Data Analyst                       |87000     |87000     |87000.0   |
|Data Engineering Manager                |59303     |59303     |59303.0   |
|Staff Data Scientist                    |105000    |105000    |105000.0  |
|ETL Developer                           |54957     |54957     |54957.0   |
|Director of Data Engineering            |113476    |113476    |113476.0  |
|Product Data Analyst                    |20000     |20000     |20000.0   |
|Principal Data Scientist                |148261    |148261    |148261.0  |
|AI Scientist                            |45896     |45896     |45896.0   |
|Director of Data Science                |325000    |325000    |325000.0  |
|Machine Learning Engineer               |150000    |150000    |150000.0  |
|Lead Data Scientist                     |190000    |190000    |190000.0  |
|Machine Learning Infrastructure Engineer|50180     |50180     |50180.0   |
|Data Science Engineer                   |40189     |40189     |40189.0   |
|Machine Learning Manager                |117104    |117104    |117104.0  |
+----------------------------------------+----------+----------+----------+
only showing top 20 rows

now you need to add in df_analytic column row_id, that will show order of all job_titles depending on avg salary. they should be descending

In [9]:
windowSpec = Window.orderBy(col('avg_salary').desc())
df_analytic = df_analytic.withColumn('id', row_number().over(windowSpec))

print all data from df_analytic

In [10]:
df_analytic.toPandas()

,job_title,max_salary,min_salary,avg_salary,id
0,Financial Data Analyst,450000,450000,450000.0,1
1,Data Analytics Lead,405000,405000,405000.0,2
2,Director of Data Science,325000,325000,325000.0,3
3,Machine Learning Scientist,260000,260000,260000.0,4
4,Head of Data,235000,235000,235000.0,5
5,Principal Data Engineer,200000,200000,200000.0,6
6,Data Science Manager,190200,190200,190200.0,7
7,Lead Data Scientist,190000,190000,190000.0,8
8,Analytics Engineer,175000,175000,175000.0,9
9,Principal Data Analyst,170000,170000,170000.0,10
10,Data Specialist,165000,165000,165000.0,11
11,Machine Learning Engineer,150000,150000,150000.0,12
12,Data Architect,150000,150000,150000.0,13
13,Principal Data Scientist,148261,148261,148261.0,14
14,Business Data Analyst,135000,135000,135000.0,15
15,Lead Data Engineer,125000,125000,125000.0,16
16,Data Analytics Manager,120000,120000,120000.0,17
17,Machine Learning Manager,117104,117104,117104.0,18
18,Director of Data Engineering,113476,113476,113476.0,19
19,Big Data Engineer,109024,109024,109024.0,20
20,Staff Data Scientist,105000,105000,105000.0,21
21,Machine Learning Developer,100000,100000,100000.0,22
22,Big Data Architect,99703,99703,99703.0,23
23,BI Data Analyst,98000,98000,98000.0,24
24,Cloud Data Engineer,89294,89294,89294.0,25
25,Marketing Data Analyst,88654,88654,88654.0,26
26,Lead Machine Learning Engineer,87932,87932,87932.0,27
27,Lead Data Analyst,87000,87000,87000.0,28
28,Head of Data Science,85000,85000,85000.0,29
29,Data Scientist,79833,79833,79833.0,30
30,Data Analytics Engineer,79197,79197,79197.0,31
31,Head of Machine Learning,79039,79039,79039.0,32
32,Data Analyst,72000,72000,72000.0,33
33,Computer Vision Software Engineer,70000,70000,70000.0,34
34,Finance Data Analyst,61896,61896,61896.0,35
35,Computer Vision Engineer,60000,60000,60000.0,36
36,Data Engineering Manager,59303,59303,59303.0,37
37,ETL Developer,54957,54957,54957.0,38
38,Applied Data Scientist,54238,54238,54238.0,39
39,Machine Learning Infrastructure Engineer,50180,50180,50180.0,40
40,AI Scientist,45896,45896,45896.0,41
41,Research Scientist,42000,42000,42000.0,42
42,Data Engineer,41689,41689,41689.0,43
43,Data Science Engineer,40189,40189,40189.0,44
44,Applied Machine Learning Scientist,38400,38400,38400.0,45
45,NLP Engineer,37236,37236,37236.0,46
46,Product Data Analyst,20000,20000,20000.0,47
47,ML Engineer,15966,15966,15966.0,48
48,Data Science Consultant,5707,5707,5707.0,49
49,3D Computer Vision Researcher,5409,5409,5409.0,50

it isn't beautifull, so we need to put now row_id on first place in df_analytic

In [11]:
df_analytic = df_analytic.select(['id', 'job_title', 'avg_salary', 'min_salary', 'max_salary'])

print df_analytic now

In [12]:
df_analytic.show()

+---+--------------------+----------+----------+----------+
| id|           job_title|avg_salary|min_salary|max_salary|
+---+--------------------+----------+----------+----------+
|  1|Financial Data An...|  450000.0|    450000|    450000|
|  2| Data Analytics Lead|  405000.0|    405000|    405000|
|  3|Director of Data ...|  325000.0|    325000|    325000|
|  4|Machine Learning ...|  260000.0|    260000|    260000|
|  5|        Head of Data|  235000.0|    235000|    235000|
|  6|Principal Data En...|  200000.0|    200000|    200000|
|  7|Data Science Manager|  190200.0|    190200|    190200|
|  8| Lead Data Scientist|  190000.0|    190000|    190000|
|  9|  Analytics Engineer|  175000.0|    175000|    175000|
| 10|Principal Data An...|  170000.0|    170000|    170000|
| 11|     Data Specialist|  165000.0|    165000|    165000|
| 12|Machine Learning ...|  150000.0|    150000|    150000|
| 13|      Data Architect|  150000.0|    150000|    150000|
| 14|Principal Data Sc...|  148261.0|    148261|    148261|
| 15|Business Data Ana...|  135000.0|    135000|    135000|
| 16|  Lead Data Engineer|  125000.0|    125000|    125000|
| 17|Data Analytics Ma...|  120000.0|    120000|    120000|
| 18|Machine Learning ...|  117104.0|    117104|    117104|
| 19|Director of Data ...|  113476.0|    113476|    113476|
| 20|   Big Data Engineer|  109024.0|    109024|    109024|
+---+--------------------+----------+----------+----------+
only showing top 20 rows

here you need to create df_exp_lvl with the biggest usd_salary(biggest_salary) for each experience_level(you need to save all fields like in entire dataframe)

In [28]:
df_exp_lvl = df.groupBy('experiecne_level') \
                .agg(first('work_year').alias('work_year'),
                     first('experiecne_level').alias('experiecne_level'),
                     first('employment_type').alias('employment_type'),
                     first('job_title').alias('job_title'),
                     first('salary').alias('salary'),
                     first('salary_currency').alias('salary_currency'),
                     first('employee_residence').alias('employee_residence'),
                     first('remote_ratio').alias('remote_ratio'),
                     first('company_location').alias('company_location'),
                     first('company_size').alias('company_size'),
                     max('salary_in_usd').alias('max_salary'))

print here df_exp_lvl

In [29]:
df_exp_lvl.show()

+----------------+---------+----------------+---------------+--------------------+------+---------------+------------------+------------+----------------+------------+----------+
|experiecne_level|work_year|experiecne_level|employment_type|           job_title|salary|salary_currency|employee_residence|remote_ratio|company_location|company_size|max_salary|
+----------------+---------+----------------+---------------+--------------------+------+---------------+------------------+------------+----------------+------------+----------+
|              EN|     2020|              EN|             FT|        Data Analyst| 72000|            USD|                US|         100|              US|           L|    250000|
|              EX|     2020|              EX|             FT|Director of Data ...|325000|            USD|                US|         100|              US|           L|    600000|
|              MI|     2020|              MI|             FT|      Data Scientist| 70000|            EUR|                DE|           0|              DE|           L|    450000|
|              SE|     2020|              SE|             FT|Machine Learning ...|260000|            USD|                JP|           0|              JP|           S|    412000|
+----------------+---------+----------------+---------------+--------------------+------+---------------+------------------+------------+----------------+------------+----------+

create df_best that consists from rows where salary of guy same as biggest salary for other people in his exp_lvl and choose only columns: id, experience_level, biggest_salary, employee_residence

In [45]:
df_join = df.join(df_exp_lvl, on='experiecne_level', how='inner')
df_best = df.filter(col('salary_in_usd')== col('max_salary'))

AnalysisException: [UNRESOLVED_COLUMN.WITH_SUGGESTION] A column or function parameter with name `max_salary` cannot be resolved. Did you mean one of the following? [`salary`, `work_year`, `id`, `job_title`, `company_size`].;
'Filter (salary_in_usd#7 = 'max_salary)
+- Relation [id#0,work_year#1,experiecne_level#2,employment_type#3,job_title#4,salary#5,salary_currency#6,salary_in_usd#7,employee_residence#8,remote_ratio#9,company_location#10,company_size#11] csv

print df_best

drop duplicates if exist by experience_level

print df_best

create df_new_best from df_best without id, and make the next: when exp_level = MI we want middle, when SE we want senior, else Null

print df_new_best

write df_new_best like 1.csv and load then it to df_final

print df_final

filter df_final to delete experience_level where it Null, then join this table by biggest_salary(salary_in_usd) and employee_residence with entire df

print df_final

last task is to save in variable and then print this variable of the biggest salary_in_usd from df_final

It is the end of PySpark basics. In other lessons you will learn optimizations technics and how to make distributed system